In [1]:
import pandas as pd
from nltk.stem import WordNetLemmatizer

/usr/lib/python3/dist-packages/scipy/__init__.py:146: UserWarning: A NumPy version >=1.17.3 and <1.25.0 is required for this version of SciPy (detected version 1.26.4
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [2]:
df = pd.read_csv("anonym_data.csv")

In [3]:
df.head()

,Unnamed: 0,clnt_id,bank_id,acc_id,txn_id,txn_date,amt,cat,merchant
0,0,2043435,681144,681144,681197,31/07/2023 0:00,6.286,Shops,NaN
1,1,2043435,681144,681144,681170,31/07/2023 0:00,6.286,Shops,NaN
2,2,2043435,681144,681144,681154,01/08/2023 0:00,2.268,Shops,NaN
3,3,2043457,681144,681144,681251,25/07/2023 0:00,59.100,Shops,1INFINITE
4,4,2043457,681144,681144,681279,14/08/2023 0:00,4.924,Shops,1INFINITE

In [4]:
df.dtypes

Unnamed: 0      int64
clnt_id         int64
bank_id         int64
acc_id          int64
txn_id          int64
txn_date       object
amt           float64
cat            object
merchant       object
dtype: object

In [5]:
# txn_date should be of datetime type for comparisions
df['txn_date'] = pd.to_datetime(df["txn_date"])

/tmp/ipykernel_8688/3408429673.py:2: UserWarning: Parsing dates in %d/%m/%Y %H:%M format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['txn_date'] = pd.to_datetime(df["txn_date"])

In [6]:
# df['txn_year'] = df['txn_date'].dt.year
# df['txn_month'] = df['txn_date'].dt.month
# df['txn_day'] = df['txn_date'].dt.day
# df['txn_day_of_week'] = df['txn_date'].dt.dayofweek
# df['txn_week_of_month'] = df.txn_date.apply(lambda d: (d.day-1) // 7 + 1)
# df['txn_day_of_year'] = df.txn_date.apply(lambda x: x.dayofyear)
# df['txn_week_of_year'] = df.txn_date.apply(lambda x: x.weekofyear)

In [6]:
lemmatizer = WordNetLemmatizer()
df["lemm_merchant"] = df["merchant"].apply(lambda x: lemmatizer.lemmatize(str(x).lower()))
df["lemm_cat"] = df["cat"].apply(lambda x: lemmatizer.lemmatize(str(x).lower()))

In [7]:
df.head()

,Unnamed: 0,clnt_id,bank_id,acc_id,txn_id,txn_date,amt,cat,merchant,lemm_merchant,lemm_cat
0,0,2043435,681144,681144,681197,2023-07-31,6.286,Shops,NaN,nan,shop
1,1,2043435,681144,681144,681170,2023-07-31,6.286,Shops,NaN,nan,shop
2,2,2043435,681144,681144,681154,2023-08-01,2.268,Shops,NaN,nan,shop
3,3,2043457,681144,681144,681251,2023-07-25,59.100,Shops,1INFINITE,1infinite,shop
4,4,2043457,681144,681144,681279,2023-08-14,4.924,Shops,1INFINITE,1infinite,shop

In [8]:
df.isnull().sum()

Unnamed: 0            0
clnt_id               0
bank_id               0
acc_id                0
txn_id                0
txn_date              0
amt                   0
cat                   0
merchant         124881
lemm_merchant         0
lemm_cat              0
dtype: int64

In [9]:
df["merchant"] = df["merchant"].fillna("N/A")

In [10]:
df.isnull().sum()

Unnamed: 0       0
clnt_id          0
bank_id          0
acc_id           0
txn_id           0
txn_date         0
amt              0
cat              0
merchant         0
lemm_merchant    0
lemm_cat         0
dtype: int64

In [11]:
df.head()

,Unnamed: 0,clnt_id,bank_id,acc_id,txn_id,txn_date,amt,cat,merchant,lemm_merchant,lemm_cat
0,0,2043435,681144,681144,681197,2023-07-31,6.286,Shops,N/A,nan,shop
1,1,2043435,681144,681144,681170,2023-07-31,6.286,Shops,N/A,nan,shop
2,2,2043435,681144,681144,681154,2023-08-01,2.268,Shops,N/A,nan,shop
3,3,2043457,681144,681144,681251,2023-07-25,59.100,Shops,1INFINITE,1infinite,shop
4,4,2043457,681144,681144,681279,2023-08-14,4.924,Shops,1INFINITE,1infinite,shop

In [12]:
len(df["cat"].unique()) # Adding all to prompt will have a negative effect

32

In [13]:
len(df["merchant"].unique()) # So much merchants, can't add to prompts

3867

In [14]:
df.to_csv("Processed_Data.csv",index=None)